src/ExternalDataProcessors/ЧатWhatsApp/ЧатWhatsApp.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ЧатWhatsApp</name>
  <attributes>
    <name>idInstance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>apiTokenInstance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>apiUrl</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЧатов</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/ЧатWhatsApp/Forms/Авторизация/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура apiUrlПриИзменении(Элемент)
	
	Если СтрЗаканчиваетсяНа(Объект.apiUrl, "/") Тогда
		Объект.apiUrl = Лев(Объект.apiUrl, СтрДлина(Объект.apiUrl) - 1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизация(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАвторзиации = Новый Структура("idInstance, apiTokenInstance, apiUrl", Объект.idInstance, Объект.apiTokenInstance, Объект.apiUrl);
	ОткрытьФорму("ВнешняяОбработка.ЧатWhatsApp.Форма.ФормаЧата", ПараметрыАвторзиации);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
